using System.Collections.Generic;
using UnityEngine;

public class 全局装备库
{
	public static List<装备属性库类> 属性表 = new List<装备属性库类>();

	public static void 初始化装备库()
	{
		属性表.Clear();
		属性表.Add(new 装备属性库类("空", "", 0.0, 0.0));
		属性表.Add(new 装备属性库类("精钢剑", "武器", 20.0, 30.0));
		属性表.Add(new 装备属性库类("青铜盔", "头盔", 22.0, 30.0));
		属性表.Add(new 装备属性库类("青铜铠", "铠甲", 22.0, 15.0));
		属性表.Add(new 装备属性库类("战马", "坐骑", 15.0, 50.0));
		属性表.Add(new 装备属性库类("白银铠", "铠甲", 44.0, 31.0));
		属性表.Add(new 装备属性库类("白银盔", "头盔", 46.0, 54.0));
		属性表.Add(new 装备属性库类("黄骠马", "坐骑", 49.0, 120.0));
		属性表.Add(new 装备属性库类("黄金铠", "铠甲", 56.0, 39.0));
		属性表.Add(new 装备属性库类("鬼头刀", "武器", 65.0, 75.0));
		属性表.Add(new 装备属性库类("大宛马", "坐骑", 66.0, 155.0));
		属性表.Add(new 装备属性库类("紫金铠", "铠甲", 68.0, 47.0));
		属性表.Add(new 装备属性库类("紫金盔", "头盔", 70.0, 78.0));
		属性表.Add(new 装备属性库类("牡羊宝剑", "武器", 70.0, 90.0));
		属性表.Add(new 装备属性库类("牡羊晶甲", "铠甲", 70.0, 50.0));
		属性表.Add(new 装备属性库类("牡羊云盔", "头盔", 70.0, 85.0));
		属性表.Add(new 装备属性库类("牡羊骏", "坐骑", 70.0, 180.0));
		属性表.Add(new 装备属性库类("长柄刀", "武器", 70.0, 80.0));
		属性表.Add(new 装备属性库类("五彩神牛", "坐骑", 70.0, 180.0));
		属性表.Add(new 装备属性库类("金甲", "铠甲", 70.0, 50.0));
		属性表.Add(new 装备属性库类("凤翅盔", "头盔", 70.0, 85.0));
		属性表.Add(new 装备属性库类("霸王枪", "武器", 75.0, 85.0));
		属性表.Add(new 装备属性库类("九齿钉耙", "武器", 80.0, 100.0));
		属性表.Add(new 装备属性库类("金猪", "坐骑", 80.0, 200.0));
		属性表.Add(new 装备属性库类("玄冠", "头盔", 80.0, 95.0));
		属性表.Add(new 装备属性库类("黑衣金甲", "铠甲", 80.0, 55.0));
		属性表.Add(new 装备属性库类("雌雄双剑", "武器", 80.0, 100.0));
		属性表.Add(new 装备属性库类("古锭刀", "武器", 80.0, 100.0));
		属性表.Add(new 装备属性库类("玄武铠", "铠甲", 80.0, 55.0));
		属性表.Add(new 装备属性库类("玄武盔", "头盔", 80.0, 95.0));
		属性表.Add(new 装备属性库类("爪黄飞电", "坐骑", 80.0, 200.0));
		属性表.Add(new 装备属性库类("七星刀", "武器", 85.0, 110.0));
		属性表.Add(new 装备属性库类("倚天剑", "武器", 85.0, 110.0));
		属性表.Add(new 装备属性库类("白虎铠", "铠甲", 85.0, 60.0));
		属性表.Add(new 装备属性库类("白虎盔", "头盔", 85.0, 105.0));
		属性表.Add(new 装备属性库类("绝影", "坐骑", 85.0, 220.0));
		属性表.Add(new 装备属性库类("龙胆枪", "武器", 90.0, 120.0));
		属性表.Add(new 装备属性库类("战袍", "铠甲", 90.0, 65.0));
		属性表.Add(new 装备属性库类("凤翔盔", "头盔", 90.0, 115.0));
		属性表.Add(new 装备属性库类("乌骓", "坐骑", 90.0, 240.0));
		属性表.Add(new 装备属性库类("诸葛扇", "武器", 90.0, 120.0));
		属性表.Add(new 装备属性库类("朱雀铠", "铠甲", 90.0, 65.0));
		属性表.Add(new 装备属性库类("朱雀盔", "头盔", 90.0, 110.0));
		属性表.Add(new 装备属性库类("的卢", "坐骑", 90.0, 200.0));
		属性表.Add(new 装备属性库类("玄铁双戟", "武器", 90.0, 120.0));
		属性表.Add(new 装备属性库类("青龙偃月刀", "武器", 95.0, 130.0));
		属性表.Add(new 装备属性库类("虎头湛金枪", "武器", 95.0, 130.0));
		属性表.Add(new 装备属性库类("青龙盔", "头盔", 95.0, 120.0));
		属性表.Add(new 装备属性库类("青龙铠", "铠甲", 95.0, 70.0));
		属性表.Add(new 装备属性库类("宝马", "坐骑", 95.0, 260.0));
		属性表.Add(new 装备属性库类("赤兔", "坐骑", 95.0, 260.0));
		属性表.Add(new 装备属性库类("新亭侯刀", "武器", 95.0, 130.0));
		属性表.Add(new 装备属性库类("天龙盔", "头盔", 95.0, 125.0));
		属性表.Add(new 装备属性库类("帅袍", "铠甲", 95.0, 75.0));
		属性表.Add(new 装备属性库类("里飞沙", "坐骑", 95.0, 260.0));
		属性表.Add(new 装备属性库类("方天画戟", "武器", 95.0, 130.0));
		属性表.Add(new 装备属性库类("丈八蛇矛", "武器", 95.0, 130.0));
		属性表.Add(new 装备属性库类("黄袍", "铠甲", 99.0, 95.0));
		属性表.Add(new 装备属性库类("照夜玉狮子", "坐骑", 99.0, 280.0));
		属性表.Add(new 装备属性库类("冕冠", "头盔", 99.0, 150.0));
		属性表.Add(new 装备属性库类("龙袍", "铠甲", 99.0, 100.0));
		属性表.Add(new 装备属性库类("天子剑", "武器", 99.0, 150.0));
		属性表.Add(new 装备属性库类("龙椅", "坐骑", 99.0, 300.0));
		属性表.Add(new 装备属性库类("帝王冕", "头盔", 99.0, 180.0));
		属性表.Add(new 装备属性库类("帝王剑", "武器", 99.0, 180.0));
		属性表.Add(new 装备属性库类("帝王铠", "铠甲", 99.0, 130.0));
		属性表.Add(new 装备属性库类("帝王辇", "坐骑", 99.0, 320.0));
		属性表.Add(new 装备属性库类("尊·皇冠", "头盔", 99.0, 200.0));
		属性表.Add(new 装备属性库类("尊·龙剑", "武器", 99.0, 200.0));
		属性表.Add(new 装备属性库类("尊·龙袍", "铠甲", 99.0, 180.0));
		属性表.Add(new 装备属性库类("尊·龙椅", "坐骑", 99.0, 350.0));
	}

	public static 装备属性库类 获取指定等级内的随机装备(int 装备等级, string 类型)
	{
		List<int> list = new List<int>();
		int count = 属性表.Count;
		for (int i = 0; i < count; i++)
		{
			if (属性表[i].等级 <= (double)装备等级 && 属性表[i].类型 == 类型)
			{
				list.Add(i);
			}
		}
		if (list.Count > 0)
		{
			int index = Random.Range(0, list.Count);
			return 属性表[list[index]];
		}
		return null;
	}

	public static 装备属性库类 获取指定名字的装备(string 装备名字)
	{
		int count = 属性表.Count;
		for (int i = 0; i < count; i++)
		{
			if (属性表[i].名称 == 装备名字)
			{
				return 属性表[i];
			}
		}
		return null;
	}

	public static int 查询指定装备的图片(string 装备名字)
	{
		int count = 全局变量.所有装备资源表.Count;
		for (int i = 0; i < count; i++)
		{
			if (全局变量.所有装备资源表[i].name == 装备名字)
			{
				return i;
			}
		}
		return -1;
	}
}
