using System;
using System.Collections.Generic;
using Unity.Mathematics;
using UnityEngine;

[Serializable]
public class 全局将领库
{
	public static List<将领属性库类> 属性表 = new List<将领属性库类>();
	
	public static void 初始化将领库()
	{
		double num = 0.0;
		将领属性库类 将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成普通将领(1.0, "普通男将");
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成普通将领(2.0, "普通女将");
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成良好将领(3.0, "良好男将");
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成良好将领(4.0, "良好女将");
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成优秀将领(5.0, "优秀男将");
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成优秀将领(6.0, "优秀女将");
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成卓越将领(7.0, "卓越男将");
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成卓越将领(8.0, "卓越女将");
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.ID = 100.0;
		将领属性库类.名字 = "尊·帝王";
		将领属性库类.头像特效 = 6.0;
		将领属性库类.成长 = 92.0;
		将领属性库类.突围 = 99.0;
		将领属性库类.类型 = 1.0;
		将领属性库类.职业 = 1;
		将领属性库类.统帅 = (将领属性库类.智力 = (将领属性库类.武力 = UnityEngine.Random.Range(130, 141)));
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成尊将(101.0, "尊·关羽", "彩色", "平", "骑");
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成尊将(102.0, "尊·诸葛亮", "彩色", "智", "勇");
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成尊将(103.0, "尊·周瑜", "黄色", "统", "勇");
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成尊将(104.0, "尊·赵云", "彩色", "平", "骑");
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成尊将(105.0, "尊·张飞", "彩色", "攻", "骑");
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成尊将(106.0, "尊·袁绍", "彩色", "智", "勇");
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成尊将(107.0, "尊·徐庶", "紫色", "智", "步");
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成尊将(108.0, "尊·小乔", "绿色", "统", "弓");
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成尊将(109.0, "尊·献帝", "黄色", "平", "勇");
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成尊将(110.0, "尊·孙权", "黄色", "平", "勇");
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成尊将(111.0, "尊·司马懿", "彩色", "平", "骑");
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成尊将(112.0, "尊·庞统", "紫色", "智", "步");
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成尊将(113.0, "尊·马超", "彩色", "攻", "骑");
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成尊将(114.0, "尊·吕布", "彩色", "攻", "骑");
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成尊将(115.0, "尊·刘备", "彩色", "平", "骑");
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成尊将(116.0, "尊·黄忠", "绿色", "攻", "弓");
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成尊将(117.0, "尊·董卓", "黄色", "统", "骑");
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成尊将(118.0, "尊·貂蝉", "黄色", "统", "勇");
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成尊将(119.0, "尊·大乔", "绿色", "统", "弓");
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成尊将(120.0, "尊·曹操", "彩色", "平", "骑");
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成尊将(121.0, "尊·鲍三娘", "彩色", "平", "骑");
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成战将(301.0, "战·关羽", "平", "骑");
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成战将(302.0, "战·黄忠", "攻", "弓");
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成战将(303.0, "战·吕布", "攻", "骑");
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成战将(304.0, "战·许子将", "智", "步");
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成战将(305.0, "战·周瑜", "统", "勇");
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成战将(306.0, "战·诸葛亮", "智", "勇");
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成君王(201.0, "孙坚", "", "攻", "弓");
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成君王(202.0, "吕玲绮", "", "攻", "骑");
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成君王(203.0, "马云禄", "", "智", "骑");
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成君王(204.0, "庞德公", "", "智", "步");
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成君王(205.0, "卞夫人", "", "平", "勇");
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成君王(206.0, "孙策", "", "平", "骑");
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成君王(207.0, "黄舞蝶", "", "攻", "弓");
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成君王(208.0, "吴国太", "", "智", "步");
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成君王(209.0, "曹婴", "", "平", "骑");
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成君王(210.0, "诸葛果", "", "智", "勇");
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成君王(211.0, "董白", "", "智", "步");
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成君王(212.0, "鲍三娘", "", "平", "骑");
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成君王(213.0, "邹夫人", "", "统", "弓");
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成君王(214.0, "樊夫人", "", "统", "骑");
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成君王(215.0, "南华老仙", "", "智", "勇");
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成君王(216.0, "花鬘", "", "智", "步");
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成君王(217.0, "步练师", "", "统", "勇");
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成禧将(401.0, "禧·鲍三娘", "平", "骑");
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成禧将(402.0, "禧·花鬘", "智", "步");
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成禧将(403.0, "禧·步练师", "统", "勇");
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成禧将(404.0, "禧·黄舞蝶", "攻", "弓");
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成君王(1000.0, "刘备", "蜀", "平", "骑");
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(1002.0, "关羽", "蜀", "平", "骑", 99.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(1003.0, "赵云", "蜀", "平", "骑", 99.0);
		属性表.Add(将领属性库类);
        将领属性库类 = new 将领属性库类();
        将领属性库类.快捷生成名将(1004.0, "姜维", "蜀", "平", "骑", 96.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(1005.0, "张飞", "蜀", "攻", "骑", 96.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(1006.0, "廖化", "蜀", "攻", "骑", 94.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(1007.0, "王平", "蜀", "攻", "骑", 94.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(1008.0, "魏延", "蜀", "攻", "骑", 94.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(1009.0, "关平", "蜀", "攻", "骑", 92.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(1010.0, "关索", "蜀", "攻", "骑", 90.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(1011.0, "关兴", "蜀", "攻", "骑", 90.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(1012.0, "徐庶", "蜀", "智", "步", 96.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(1013.0, "黄月英", "蜀", "智", "步", 92.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(1014.0, "庞统", "蜀", "智", "步", 92.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(1015.0, "周仓", "蜀", "攻", "步", 94.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(1016.0, "刘禅", "蜀", "统", "步", 90.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(1017.0, "诸葛亮", "蜀", "智", "勇", 99.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(1018.0, "关凤", "蜀", "攻", "弓", 92.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(1019.0, "黄忠", "蜀", "攻", "弓", 96.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成君王(2000.0, "袁绍", "赵", "智", "勇");
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(2001.0, "文丑", "赵", "攻", "骑", 92.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(2002.0, "颜良", "赵", "攻", "骑", 92.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(2003.0, "郭图", "赵", "智", "步", 92.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(2004.0, "审配", "赵", "智", "步", 94.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(2005.0, "沮授", "赵", "智", "步", 94.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(2006.0, "田丰", "赵", "智", "步", 94.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(2007.0, "淳于琼", "赵", "攻", "弓", 94.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(2008.0, "鞠义", "赵", "统", "骑", 90.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成君王(3000.0, "献帝", "汉", "平", "勇");
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(3001.0, "貂蝉", "汉", "统", "勇", 92.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(3002.0, "左慈", "汉", "平", "勇", 99.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(3003.0, "陈宫", "汉", "智", "勇", 92.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(3004.0, "张邈", "汉", "智", "骑", 90.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(3005.0, "王允", "汉", "智", "步", 90.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成君王(4000.0, "董卓", "秦", "统", "骑");
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(4001.0, "华雄", "秦", "攻", "骑", 92.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(4002.0, "吕布", "秦", "攻", "骑", 99.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(4003.0, "徐荣", "秦", "攻", "骑", 94.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(4004.0, "高顺", "秦", "攻", "骑", 94.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成君王(5000.0, "刘表", "楚", "智", "骑");
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(5001.0, "蔡瑁", "楚", "智", "步", 92.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(5002.0, "刑道荣", "楚", "统", "步", 90.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(5003.0, "苏飞", "楚", "攻", "弓", 90.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(5004.0, "文聘", "楚", "攻", "骑", 94.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成君王(6000.0, "张鲁", "晋", "统", "勇");
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(6001.0, "高沛", "晋", "攻", "骑", 90.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(6002.0, "程银", "晋", "智", "骑", 90.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(6003.0, "张横", "晋", "智", "步", 90.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(6004.0, "杨松", "晋", "攻", "弓", 90.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成君王(7000.0, "公孙瓒", "胡", "攻", "弓");
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(7001.0, "韩馥", "胡", "攻", "骑", 92.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(7002.0, "潘凤", "胡", "攻", "骑", 90.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(7003.0, "田畴", "胡", "攻", "骑", 90.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(7004.0, "邓茂", "胡", "攻", "步", 90.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(7005.0, "曹化", "胡", "攻", "弓", 90.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成君王(8000.0, "马腾", "羌", "攻", "骑");
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(8001.0, "马超", "羌", "攻", "骑", 96.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(8002.0, "马岱", "羌", "攻", "骑", 94.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(8003.0, "马铁", "羌", "攻", "骑", 90.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(8004.0, "庞德", "羌", "攻", "骑", 96.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(8005.0, "韩遂", "羌", "智", "骑", 92.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(8006.0, "迷当大王", "羌", "统", "步", 90.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(8007.0, "马休", "羌", "攻", "弓", 90.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成君王(9000.0, "袁术", "陈", "平", "骑");
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(9001.0, "蒋干", "陈", "智", "步", 92.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(9002.0, "陈横", "陈", "攻", "弓", 90.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(9003.0, "袁胤", "陈", "攻", "弓", 90.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(9004.0, "严政", "陈", "统", "勇", 90.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(9005.0, "虞翻", "陈", "统", "弓", 90.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成君王(10000.0, "孟获", "蛮", "统", "弓");
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(10001.0, "木鹿大王", "蛮", "攻", "骑", 90.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(10002.0, "忙牙长", "蛮", "智", "骑", 90.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(10003.0, "带来洞主", "蛮", "智", "步", 90.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(10004.0, "沙摩柯", "蛮", "统", "勇", 90.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(10005.0, "祝融夫人", "蛮", "统", "弓", 92.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成君王(11000.0, "陶谦", "鲁", "智", "步");
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(11001.0, "糜芳", "鲁", "攻", "弓", 92.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(11002.0, "糜竺", "鲁", "统", "弓", 92.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(11003.0, "陈群", "鲁", "智", "步", 92.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(11004.0, "车胄", "鲁", "攻", "骑", 90.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成君王(12000.0, "公孙度", "燕", "平", "步");
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(12001.0, "公孙恭", "燕", "攻", "骑", 90.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(12002.0, "何义", "燕", "攻", "骑", 90.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(12003.0, "杨祚", "燕", "智", "步", 90.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(12004.0, "公孙康", "燕", "攻", "弓", 90.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成君王(13000.0, "孙权", "吴", "平", "勇");
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(13001.0, "太史慈", "吴", "攻", "骑", 96.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(13002.0, "程普", "吴", "攻", "骑", 92.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(13003.0, "黄盖", "吴", "攻", "骑", 92.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(13004.0, "凌统", "吴", "攻", "骑", 94.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(13005.0, "陆逊", "吴", "智", "步", 96.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(13006.0, "甄姬", "吴", "智", "步", 92.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(13007.0, "诸葛瑾", "吴", "智", "步", 92.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(13008.0, "吕蒙", "吴", "攻", "步", 96.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(13009.0, "孙尚香", "吴", "攻", "步", 92.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(13010.0, "甘宁", "吴", "攻", "步", 96.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(13011.0, "董袭", "吴", "攻", "步", 94.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(13012.0, "丁奉", "吴", "攻", "步", 94.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(13013.0, "周瑜", "吴", "统", "勇", 99.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(13014.0, "鲁肃", "吴", "统", "勇", 96.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(13015.0, "陈武", "吴", "攻", "弓", 94.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(13016.0, "徐盛", "吴", "攻", "弓", 94.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(13017.0, "潘璋", "吴", "攻", "弓", 94.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(13018.0, "蒋钦", "吴", "攻", "弓", 92.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(13019.0, "蔡文姬", "吴", "智", "弓", 92.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(13020.0, "小乔", "吴", "统", "弓", 92.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(13021.0, "大乔", "吴", "统", "弓", 92.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成君王(14000.0, "曹操", "魏", "平", "骑");
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(14001.0, "邓艾", "魏", "平", "骑", 96.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(14002.0, "司马懿", "魏", "平", "骑", 99.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(14003.0, "钟会", "魏", "平", "骑", 94.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(14004.0, "曹仁", "魏", "攻", "骑", 94.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(14005.0, "夏侯惇", "魏", "攻", "骑", 92.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(14006.0, "曹彰", "魏", "攻", "骑", 94.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(14007.0, "于禁", "魏", "攻", "骑", 94.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(14008.0, "张辽", "魏", "攻", "骑", 96.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(14009.0, "张郃", "魏", "攻", "骑", 96.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(14010.0, "曹植", "魏", "智", "步", 92.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(14011.0, "程昱", "魏", "智", "步", 96.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(14012.0, "许子将", "魏", "智", "步", 99.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(14013.0, "郭嘉", "魏", "智", "步", 96.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(14014.0, "荀攸", "魏", "智", "步", 94.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(14015.0, "贾诩", "魏", "智", "步", 96.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(14016.0, "李典", "魏", "攻", "步", 96.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(14017.0, "郝昭", "魏", "平", "勇", 94.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(14018.0, "满宠", "魏", "平", "勇", 92.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(14019.0, "许褚", "魏", "攻", "勇", 96.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(14020.0, "曹洪", "魏", "攻", "勇", 94.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(14021.0, "典韦", "魏", "攻", "勇", 96.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(14022.0, "乐进", "魏", "攻", "勇", 94.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(14023.0, "荀彧", "魏", "智", "勇", 96.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(14024.0, "徐晃", "魏", "统", "勇", 94.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(14025.0, "刘晔", "魏", "攻", "弓", 94.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(14026.0, "曹丕", "魏", "攻", "弓", 92.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(14027.0, "曹休", "魏", "攻", "弓", 92.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(15001.0, "邹玉", "野", "攻", "骑", 92.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(15002.0, "张燕", "野", "攻", "骑", 92.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(15003.0, "张绣", "野", "攻", "骑", 92.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(15004.0, "雷铜", "野", "攻", "骑", 92.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(15005.0, "吕义", "野", "攻", "骑", 90.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(15006.0, "董允", "野", "攻", "骑", 90.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(15007.0, "韩忠", "野", "攻", "骑", 90.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(15008.0, "吕虔", "野", "智", "骑", 90.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(15009.0, "张济", "野", "智", "骑", 90.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(15010.0, "朱然", "野", "智", "骑", 90.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(15011.0, "张允", "野", "攻", "弓", 90.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(15012.0, "诸葛均", "野", "攻", "弓", 90.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(15013.0, "天香", "野", "统", "弓", 92.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(15014.0, "芙蓉", "野", "统", "弓", 92.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(15015.0, "张宁", "野", "统", "弓", 90.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(15016.0, "陈泰", "野", "智", "步", 94.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(15017.0, "司马师", "野", "平", "勇", 92.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(15018.0, "华佗", "野", "智", "勇", 92.0);
		属性表.Add(将领属性库类);
		将领属性库类 = new 将领属性库类();
		将领属性库类.快捷生成名将(15019.0, "诸葛芸", "野", "统", "勇", 92.0);
		属性表.Add(将领属性库类);

		
	}

	public static string 随机获取一个君王名()
	{
		string[] array = new string[31]
		{
			"步练师",
			"花鬘",
			"南华老仙",
			"樊夫人",
			"邹夫人",
			"鲍三娘",
			"董白",
			"诸葛果",
			"曹婴",
			"吴国太",
			"黄舞蝶",
			"孙策",
			"卞夫人",
			"庞德公",
			"马云禄",
			"吕玲绮",
			"孙坚",
			"刘备",
			"袁绍",
			"献帝",
			"董卓",
			"刘表",
			"张鲁",
			"公孙瓒",
			"马腾",
			"袁术",
			"孟获",
			"陶谦",
			"公孙度",
			"孙权",
			"曹操"
		};
		int num = UnityEngine.Random.Range(1, array.Length);
		return array[num];
	}

	public static string 随机获取一个战将名()
	{
		string[] array = new string[6]
		{
			"战·诸葛亮",
			"战·周瑜",
			"战·许子将",
			"战·吕布",
			"战·黄忠",
			"战·关羽"
		};
		int num = UnityEngine.Random.Range(1, array.Length);
		return array[num];
	}

	public static string 随机获取一个尊将名()
	{
		string[] array = new string[21]
		{
			"尊·鲍三娘",
			"尊·曹操",
			"尊·大乔",
			"尊·貂蝉",
			"尊·董卓",
			"尊·黄忠",
			"尊·刘备",
			"尊·吕布",
			"尊·马超",
			"尊·庞统",
			"尊·司马懿",
			"尊·孙权",
			"尊·献帝",
			"尊·小乔",
			"尊·徐庶",
			"尊·关羽",
			"尊·诸葛亮",
			"尊·周瑜",
			"尊·赵云",
			"尊·张飞",
			"尊·袁绍"
		};
		int num = UnityEngine.Random.Range(1, array.Length);
		return array[num];
	}

	public static string 随机获取一个禧将名()
	{
		string[] array = new string[4]
		{
			"禧·鲍三娘",
			"禧·花鬘",
			"禧·步练师",
			"禧·黄舞蝶"
		};
		int num = UnityEngine.Random.Range(1, array.Length);
		return array[num];
	}

	public static List<将领属性库类> 获取指定国家的所有名将(string 国家名字)
	{
		List<将领属性库类> list = new List<将领属性库类>();
		int count = 属性表.Count;
		for (int i = 0; i < count; i++)
		{
			if (属性表[i].国家 == 国家名字)
			{
				list.Add(属性表[i]);
			}
		}
		return list;
	}

	public static 将领属性库类 查询指定名字的将领数据(string 要查询的名字)
	{
		return 属性表.Find((将领属性库类 s) => s.名字 == 要查询的名字);
	}

	public static 将领属性库类 查询指定ID的将领数据(double 要查询的ID)
	{
		return 属性表.Find((将领属性库类 s) => s.ID == 要查询的ID);
	}

	public static string 查询指定ID的名字(double 要查询的ID)
	{
		int count = 属性表.Count;
		for (int i = 0; i < count; i++)
		{
			if (属性表[i].ID == 要查询的ID)
			{
				return 属性表[i].名字;
			}
		}
		return "未知";
	}

	public static Sprite 获取指定将领的头像(string 将领名字)
	{
		int count = 全局变量.所有头像资源表.Count;
		for (int i = 0; i < count; i++)
		{
			if (全局变量.所有头像资源表[i].name == 将领名字)
			{
				return 全局变量.所有头像资源表[i];
			}
		}
		if (查询指定名字的将领数据(将领名字).系列 == "名将")
		{
			count = 全局变量.所有头像资源表.Count;
			for (int j = 0; j < count; j++)
			{
				if (全局变量.所有头像资源表[j].name == "普通名将男")
				{
					return 全局变量.所有头像资源表[j];
				}
			}
		}
		return 全局变量.未知头像;
	}

	public static int 查询指定将领的头像(string 将领名字)
	{
		int count = 全局变量.所有头像资源表.Count;
		for (int i = 0; i < count; i++)
		{
			if (全局变量.所有头像资源表[i].name == 将领名字)
			{
				return i;
			}
		}
		return -1;
	}

	public static int 查询指定ID的头像特效(double 要查询的ID)
	{
		int count = 属性表.Count;
		for (int i = 0; i < count; i++)
		{
			if (属性表[i].ID == 要查询的ID)
			{
				return (int)属性表[i].头像特效;
			}
		}
		return 0;
	}
}
