using System.Collections.Generic;
using UnityEngine;
using 玩家数据结构;

public class 山贼属性信息
{
	public int 坐标x;

	public int 坐标y;

	public double 等级;

	public double 掉落宝物;

	public double 掉落宝箱;

	public double 掉落装备;

	public List<将领信息> 将领数据列表 = new List<将领信息>();

	public void 随机生成山贼(int x, int y)
	{
		将领数据列表.Clear();
		坐标x = x;
		坐标y = y;
		等级 = Random.Range(1, 11);
		掉落宝物 = 0.0;
		掉落宝箱 = 0.0;
		掉落装备 = 0.0;
		double num = 40.0 * 等级;
		double num2 = 25.0 * 等级;
		double num3 = 10.0 * 等级;
		double num4 = Random.Range(0, 1000);
		if (num4 <= num)
		{
			掉落宝物 = 1.0;
		}
		if (num4 <= num2)
		{
			掉落宝箱 = 1.0;
		}
		if (num4 <= num3)
		{
			掉落装备 = 1.0;
		}
		if (等级 <= 2.0)
		{
			将领信息 将领信息 = new 将领信息();
			将领属性库类 将领属性库类 = 全局将领库.查询指定ID的将领数据(Random.Range(1, 5));
			将领属性库类.获取随机属性();
			将领信息.生成将领数据(将领属性库类);
			将领信息.将领属性.初始属性.名字 = 随机姓名.生成随机姓名();
			将领信息.将领获取经验值(将领信息.获取升级需要经验(Random.Range(1, 4)));
			double num5 = Random.Range(2, 3);
			将领信息.将领配兵.ID = num5 * 100.0 + 1.0;
			将领信息.将领配兵.数量 = Random.Range(140, 400);
			全局变量.所有玩家数据表[1].封地信息表[0].将领信息表.Add(将领信息);
			将领数据列表.Add(将领信息);
		}
		else if (等级 == 3.0)
		{
			for (int i = 0; i < 1; i++)
			{
				将领信息 将领信息2 = new 将领信息();
				将领属性库类 将领属性库类2 = 全局将领库.查询指定ID的将领数据(Random.Range(1, 5));
				将领属性库类2.获取随机属性();
				将领信息2.生成将领数据(将领属性库类2);
				将领信息2.将领属性.初始属性.名字 = 随机姓名.生成随机姓名();
				将领信息2.将领获取经验值(将领信息2.获取升级需要经验(Random.Range(5, 9)));
				将领信息2.将领配兵.ID = 201.0;
				将领信息2.将领配兵.数量 = Random.Range(700, 900);
				全局变量.所有玩家数据表[1].封地信息表[0].将领信息表.Add(将领信息2);
				将领数据列表.Add(将领信息2);
			}
		}
		else if (等级 == 4.0)
		{
			for (int j = 0; j < 2; j++)
			{
				将领信息 将领信息3 = new 将领信息();
				将领属性库类 将领属性库类3 = 全局将领库.查询指定ID的将领数据(Random.Range(1, 5));
				将领属性库类3.获取随机属性();
				将领信息3.生成将领数据(将领属性库类3);
				将领信息3.将领属性.初始属性.名字 = 随机姓名.生成随机姓名();
				将领信息3.将领获取经验值(将领信息3.获取升级需要经验(Random.Range(8, 11)));
				double num6 = Random.Range(1, 4);
				将领信息3.将领配兵.ID = num6 * 100.0 + 1.0;
				if (num6 == 1.0)
				{
					将领信息3.将领配兵.数量 = Random.Range(350, 450);
				}
				else if (num6 == 2.0)
				{
					将领信息3.将领配兵.数量 = Random.Range(1100, 1300);
				}
				else if (num6 == 3.0)
				{
					将领信息3.将领配兵.数量 = Random.Range(350, 450);
				}
				全局变量.所有玩家数据表[1].封地信息表[0].将领信息表.Add(将领信息3);
				将领数据列表.Add(将领信息3);
			}
		}
		else if (等级 == 5.0)
		{
			for (int k = 0; k < 2; k++)
			{
				将领信息 将领信息4 = new 将领信息();
				将领属性库类 将领属性库类4 = 全局将领库.查询指定ID的将领数据(Random.Range(1, 5));
				将领属性库类4.获取随机属性();
				将领信息4.生成将领数据(将领属性库类4);
				将领信息4.将领属性.初始属性.名字 = 随机姓名.生成随机姓名();
				将领信息4.将领获取经验值(将领信息4.获取升级需要经验(Random.Range(10, 14)));
				double num7 = Random.Range(1, 5);
				将领信息4.将领配兵.ID = num7 * 100.0 + 2.0;
				if (num7 == 1.0)
				{
					将领信息4.将领配兵.数量 = Random.Range(350, 450);
				}
				else if (num7 == 2.0)
				{
					将领信息4.将领配兵.数量 = Random.Range(700, 900);
				}
				else if (num7 == 3.0)
				{
					将领信息4.将领配兵.数量 = Random.Range(350, 450);
				}
				else if (num7 == 4.0)
				{
					将领信息4.将领配兵.ID = 401.0;
					将领信息4.将领配兵.数量 = Random.Range(150, 250);
				}
				全局变量.所有玩家数据表[1].封地信息表[0].将领信息表.Add(将领信息4);
				将领数据列表.Add(将领信息4);
			}
		}
		else if (等级 == 6.0)
		{
			for (int l = 0; l < 3; l++)
			{
				将领信息 将领信息5 = new 将领信息();
				将领属性库类 将领属性库类5 = 全局将领库.查询指定ID的将领数据(Random.Range(1, 5));
				将领属性库类5.获取随机属性();
				将领信息5.生成将领数据(将领属性库类5);
				将领信息5.将领属性.初始属性.名字 = 随机姓名.生成随机姓名();
				将领信息5.将领获取经验值(将领信息5.获取升级需要经验(Random.Range(13, 16)));
				double num8 = Random.Range(1, 5);
				将领信息5.将领配兵.ID = num8 * 100.0 + 2.0;
				if (num8 == 1.0)
				{
					将领信息5.将领配兵.数量 = Random.Range(500, 700);
				}
				else if (num8 == 2.0)
				{
					将领信息5.将领配兵.数量 = Random.Range(1000, 1200);
				}
				else if (num8 == 3.0)
				{
					将领信息5.将领配兵.数量 = Random.Range(700, 800);
				}
				else if (num8 == 4.0)
				{
					将领信息5.将领配兵.ID = 401.0;
					将领信息5.将领配兵.数量 = Random.Range(300, 400);
				}
				全局变量.所有玩家数据表[1].封地信息表[0].将领信息表.Add(将领信息5);
				将领数据列表.Add(将领信息5);
			}
		}
		else if (等级 == 7.0)
		{
			for (int m = 0; m < 3; m++)
			{
				将领信息 将领信息6 = new 将领信息();
				将领属性库类 将领属性库类6 = 全局将领库.查询指定ID的将领数据(Random.Range(1, 5));
				将领属性库类6.获取随机属性();
				将领信息6.生成将领数据(将领属性库类6);
				将领信息6.将领属性.初始属性.名字 = 随机姓名.生成随机姓名();
				将领信息6.将领获取经验值(将领信息6.获取升级需要经验(Random.Range(16, 19)));
				double num9 = Random.Range(1, 5);
				将领信息6.将领配兵.ID = num9 * 100.0 + 2.0;
				if (num9 == 1.0)
				{
					将领信息6.将领配兵.数量 = Random.Range(800, 1000);
				}
				else if (num9 == 2.0)
				{
					将领信息6.将领配兵.数量 = Random.Range(1400, 1900);
				}
				else if (num9 == 3.0)
				{
					将领信息6.将领配兵.数量 = Random.Range(1000, 1300);
				}
				else if (num9 == 4.0)
				{
					将领信息6.将领配兵.ID = 401.0;
					将领信息6.将领配兵.数量 = Random.Range(500, 600);
				}
				全局变量.所有玩家数据表[1].封地信息表[0].将领信息表.Add(将领信息6);
				将领数据列表.Add(将领信息6);
			}
		}
		else if (等级 == 8.0)
		{
			for (int n = 0; n < 4; n++)
			{
				将领信息 将领信息7 = new 将领信息();
				将领属性库类 将领属性库类7 = 全局将领库.查询指定ID的将领数据(Random.Range(1, 5));
				将领属性库类7.获取随机属性();
				将领信息7.生成将领数据(将领属性库类7);
				将领信息7.将领属性.初始属性.名字 = 随机姓名.生成随机姓名();
				将领信息7.将领获取经验值(将领信息7.获取升级需要经验(Random.Range(22, 25)));
				double num10 = Random.Range(1, 5);
				将领信息7.将领配兵.ID = num10 * 100.0 + 3.0;
				if (num10 == 1.0)
				{
					将领信息7.将领配兵.数量 = Random.Range(600, 900);
				}
				else if (num10 == 2.0)
				{
					将领信息7.将领配兵.数量 = Random.Range(1100, 1300);
				}
				else if (num10 == 3.0)
				{
					将领信息7.将领配兵.数量 = Random.Range(900, 1100);
				}
				else if (num10 == 4.0)
				{
					将领信息7.将领配兵.ID = 402.0;
					将领信息7.将领配兵.数量 = Random.Range(300, 400);
				}
				全局变量.所有玩家数据表[1].封地信息表[0].将领信息表.Add(将领信息7);
				将领数据列表.Add(将领信息7);
			}
		}
		else if (等级 == 9.0)
		{
			for (int num11 = 0; num11 < 4; num11++)
			{
				将领信息 将领信息8 = new 将领信息();
				将领属性库类 将领属性库类8 = 全局将领库.查询指定ID的将领数据(Random.Range(1, 5));
				将领属性库类8.获取随机属性();
				将领信息8.生成将领数据(将领属性库类8);
				将领信息8.将领属性.初始属性.名字 = 随机姓名.生成随机姓名();
				将领信息8.将领获取经验值(将领信息8.获取升级需要经验(Random.Range(26, 29)));
				double num12 = Random.Range(1, 5);
				将领信息8.将领配兵.ID = num12 * 100.0 + 3.0;
				if (num12 == 1.0)
				{
					将领信息8.将领配兵.数量 = Random.Range(900, 1100);
				}
				else if (num12 == 2.0)
				{
					将领信息8.将领配兵.数量 = Random.Range(1500, 1800);
				}
				else if (num12 == 3.0)
				{
					将领信息8.将领配兵.数量 = Random.Range(1100, 1400);
				}
				else if (num12 == 4.0)
				{
					将领信息8.将领配兵.ID = 402.0;
					将领信息8.将领配兵.数量 = Random.Range(500, 600);
				}
				全局变量.所有玩家数据表[1].封地信息表[0].将领信息表.Add(将领信息8);
				将领数据列表.Add(将领信息8);
			}
		}
		else
		{
			if (等级 != 10.0)
			{
				return;
			}
			for (int num13 = 0; num13 < 5; num13++)
			{
				将领信息 将领信息9 = new 将领信息();
				将领属性库类 将领属性库类9 = 全局将领库.查询指定ID的将领数据(Random.Range(1, 5));
				将领属性库类9.获取随机属性();
				将领信息9.生成将领数据(将领属性库类9);
				将领信息9.将领属性.初始属性.名字 = 随机姓名.生成随机姓名();
				将领信息9.将领获取经验值(将领信息9.获取升级需要经验(Random.Range(36, 39)));
				double num14 = Random.Range(1, 5);
				将领信息9.将领配兵.ID = num14 * 100.0 + 4.0;
				if (num14 == 1.0)
				{
					将领信息9.将领配兵.数量 = Random.Range(1500, 1700);
				}
				else if (num14 == 2.0)
				{
					将领信息9.将领配兵.数量 = Random.Range(1800, 2300);
				}
				else if (num14 == 3.0)
				{
					将领信息9.将领配兵.数量 = Random.Range(1800, 2000);
				}
				else if (num14 == 4.0)
				{
					if ((double)Random.Range(0, 100) < 50.0)
					{
						将领信息9.将领配兵.ID = 404.0;
						将领信息9.将领配兵.数量 = Random.Range(230, 450);
					}
					else
					{
						将领信息9.将领配兵.ID = 402.0;
						将领信息9.将领配兵.数量 = Random.Range(700, 800);
					}
				}
				全局变量.所有玩家数据表[1].封地信息表[0].将领信息表.Add(将领信息9);
				将领数据列表.Add(将领信息9);
			}
		}
	}
}
