using UnityEngine;
using UnityEngine.UI;

public class 购买道具脚本 : MonoBehaviour
{
	public Image 道具头像对象;

	public Text 道具名字对象;

	public Text 道具说明对象;

	public Text 黄金售价对象;

	public GameObject 白银售价对象;

	public Text 黄金资产对象;

	public Text 白银资产对象;

	public Text 购买数量对象;

	public Slider 数量滑条对象;

	public GameObject 商城界面对象;

	public Text 限购数量;

	public string 道具名字;

	private double 购买数量;

	public void 刷新显示()
	{
		道具信息库类 道具信息库类 = 全局道具库.获取指定名字的道具(道具名字);
		if (道具信息库类 != null)
		{
			道具名字对象.text = 道具名字;
			道具说明对象.text = 道具信息库类.说明;
			道具头像对象.sprite = 全局道具库.获取道具头像(道具信息库类.头像);
			商品属性类 商品属性类 = 全局商城库.获取指定名字的道具(道具名字);
			黄金售价对象.text = 商品属性类.黄金售价.ToString();
			if (商品属性类.限购数量 != -1)
				限购数量.text = 商品属性类.限购数量.ToString();
			else
				限购数量.text = "库存: 无限量";
            白银售价对象.SetActive(value: false);
			if (商品属性类.白银售价 > 0.0)
			{
				白银售价对象.SetActive(value: true);
				白银售价对象.transform.GetChild(2).GetComponent<Text>().text = 商品属性类.白银售价.ToString();
			}
			int 本机身份 = 全局变量.本机身份;
			黄金资产对象.text = 全局变量.所有玩家数据表[本机身份].财产信息.黄金.ToString();
			白银资产对象.text = 全局变量.所有玩家数据表[本机身份].财产信息.白银.ToString();
			double num = 100.0;
			double num2 = Mathf.Floor((float)全局变量.所有玩家数据表[本机身份].财产信息.黄金 / (float)商品属性类.黄金售价);
			if (num2 < 100.0)
			{
				num = num2;
			}
			double num3 = Mathf.Floor((float)全局变量.所有玩家数据表[本机身份].财产信息.白银 / (float)商品属性类.白银售价);
			if (num3 < 100.0 && num3 > num2)
			{
				num = num3;
			}
			数量滑条对象.minValue = 1f;
			数量滑条对象.maxValue = (float)num;
		}
	}

	public void 黄金购买()
	{
		if (购买数量 > 0.0 && 购买数量 <= 100.0)
		{
			int 本机身份 = 全局变量.本机身份;
			商品属性类 商品 = 全局商城库.获取指定名字的道具(道具名字);
			if (商品.限购数量==-1)
			{
                double num = 商品.黄金售价 * 购买数量;
                if (全局变量.所有玩家数据表[本机身份].财产信息.黄金 > num)
                {
                    全局变量.提示类.显示信息("购买成功!");
                    全局变量.所有玩家数据表[本机身份].财产信息.黄金 = 全局变量.所有玩家数据表[本机身份].财产信息.黄金 - num;
                    全局变量.所有玩家数据表[本机身份].背包道具列表.添加道具(道具名字, (int)购买数量);
                }
                else
                {
                    全局变量.提示类.显示信息("购买失败,没有足够的黄金!");
                }
			}
			else
			{
				if (商品.限购数量 >= 购买数量)
				{
                    double num = 商品.黄金售价 * 购买数量;
                    if (全局变量.所有玩家数据表[本机身份].财产信息.黄金 > num)
                    {
                        全局变量.提示类.显示信息("购买成功!");
                        全局变量.所有玩家数据表[本机身份].财产信息.黄金 = 全局变量.所有玩家数据表[本机身份].财产信息.黄金 - num;
						商品.限购数量 -= (int)购买数量;
                        全局变量.所有玩家数据表[本机身份].背包道具列表.添加道具(道具名字, (int)购买数量);
                    }
                    else
                    {
                        全局变量.提示类.显示信息("购买失败,没有足够的黄金!");
                    }
                }
				else
				{
                    全局变量.提示类.显示信息("购买失败,超出购买限制!");
                }

            }

		}
		刷新显示();
	}

	public void 白银购买()
	{
		//if (购买数量 > 0.0 && 购买数量 <= 100.0)
		//{
		//	int 本机身份 = 全局变量.本机身份;
		//	商品属性类 商品属性类 = 全局商城库.获取指定名字的道具(道具名字);
		//	if (商品属性类 != null)
		//	{
		//		if (商品属性类.白银售价 > 0.0)
		//		{
		//			double num = 商品属性类.白银售价 * 购买数量;
		//			if (全局变量.所有玩家数据表[本机身份].财产信息.白银 > num)
		//			{
		//				全局变量.提示类.显示信息("购买成功!");
		//				全局变量.所有玩家数据表[本机身份].财产信息.白银 = 全局变量.所有玩家数据表[本机身份].财产信息.白银 - num;
		//				全局变量.所有玩家数据表[本机身份].背包道具列表.添加道具(道具名字, (int)购买数量);
		//			}
		//			else
		//			{
		//				全局变量.提示类.显示信息("购买失败,没有足够的白银!");
		//			}
		//		}
		//		else
		//		{
		//			全局变量.提示类.显示信息("不能使用白银购买!");
		//		}
		//	}
		//}
		刷新显示();
	}

    public void 黄金卖出()
    {
		int 道具数量 = (int)全局变量.所有玩家数据表[全局变量.本机身份].背包道具列表.获取指定道具数量(道具名字);
        商品属性类 商品属性类 = 全局商城库.获取指定名字的道具(道具名字);
        print(道具数量);
		if (道具数量>=购买数量)
		{
            
			double 剩余道具数量 = 道具数量- 购买数量;
            全局变量.所有玩家数据表[全局变量.本机身份].背包道具列表.删除道具(道具名字);
			if(剩余道具数量>0)
				全局变量.所有玩家数据表[全局变量.本机身份].背包道具列表.添加道具(道具名字, (int)剩余道具数量);
			全局变量.所有玩家数据表[全局变量.本机身份].财产信息.黄金 += 商品属性类.黄金售价 * 购买数量;
            全局变量.提示类.显示信息($"卖出{道具名字}{购买数量}个成功\n获得黄金{商品属性类.黄金售价* 购买数量}");

        }
		else
		{
            print("卖出失败 数量不足");
        }


        刷新显示();
    }

    public void 白银卖出()
    {
        int 道具数量 = (int)全局变量.所有玩家数据表[全局变量.本机身份].背包道具列表.获取指定道具数量(道具名字);
        商品属性类 商品属性类 = 全局商城库.获取指定名字的道具(道具名字);
        print(道具数量);
        if (道具数量 >= 购买数量)
        {
            double 剩余道具数量 = 道具数量 - 购买数量;
            全局变量.所有玩家数据表[全局变量.本机身份].背包道具列表.删除道具(道具名字);
            if (剩余道具数量 > 0)
                全局变量.所有玩家数据表[全局变量.本机身份].背包道具列表.添加道具(道具名字, (int)剩余道具数量);
            全局变量.所有玩家数据表[全局变量.本机身份].财产信息.黄金 += 商品属性类.白银售价 * 购买数量;
            全局变量.提示类.显示信息($"卖出{道具名字}{购买数量}个成功\n获得白银{商品属性类.白银售价 * 购买数量}");

        }
        else
        {
            print("卖出失败 数量不足");
        }
        刷新显示();
    }


    public void 打开购买界面()
	{
		base.gameObject.SetActive(value: true);
	}

	public void 改变购买数量()
	{
		购买数量对象.text = 数量滑条对象.value.ToString();
		购买数量 = 数量滑条对象.value;
	}

	public void 刷新商城显示()
	{
		if (商城界面对象.activeSelf)
		{
			商城界面对象.GetComponent<显示商城列表>().刷新显示();
		}
	}
}
