using UnityEngine;
using UnityEngine.UI;
using 玩家数据结构;

public class 显示国库脚本 : MonoBehaviour
{
    public Text 铜钱显示文本;

    public Text 粮食显示文本;

    private void Start()
    {
        刷新官职();
    }

    public void 获取国家国库()
    {
        国家信息库类 国家 = 全局方法类.获取指定名字的国家(全局变量.所有玩家数据表[全局变量.本机身份].基础信息.国家);
        铜钱显示文本.text = 国家.铜钱.ToString();
        粮食显示文本.text = 国家.粮食.ToString();
        print(国家.铜钱 + 国家.国名 + 国家.粮食);
    }
    private void Update()
    {
       
    }

    public void 领取俸禄()
    {
        if (全局变量.领取倒计时 > 0)
        {
            全局变量.提示类.显示信息("未到领取时间");
            return;
        }
        国家信息库类 国家 = 全局方法类.获取指定名字的国家(全局变量.所有玩家数据表[全局变量.本机身份].基础信息.国家);
        int 黄金 = 0;
        int 铜钱 = 0;
        int 粮食 = 0;
        print($"铜钱{国家.铜钱}粮食{国家.粮食}");
        switch (全局变量.所有玩家数据表[全局变量.本机身份].基础信息.官职)
        {
            case 官职信息.平民:
                全局变量.提示类.显示信息($"未有一官半职，没有俸禄可领取！！");
                return;
            case 官职信息.校尉:
                黄金 += 100000;
                粮食 = (int)(国家.粮食 * 0.5);
                铜钱 = (int)(国家.铜钱 * 0.5);
                print($"铜钱{国家.铜钱}粮食{国家.粮食},{粮食},{铜钱}");
                全局变量.所有玩家数据表[全局变量.本机身份].基础信息.战功 -= 2000;
                break;
            case 官职信息.监军:
                黄金 += 200000;
                粮食 = (int)(国家.粮食 * 0.55);
                铜钱 = (int)(国家.铜钱 * 0.55);
                全局变量.所有玩家数据表[全局变量.本机身份].基础信息.战功 -= 3000;
                break;
            case 官职信息.中郎将:
                黄金 += 300000;
                粮食 = (int)(国家.粮食 * 0.6);
                铜钱 = (int)(国家.铜钱 * 0.6);
                全局变量.所有玩家数据表[全局变量.本机身份].基础信息.战功 -= 5000;
                break;
            case 官职信息.卫将军:
                黄金 += 400000;
                粮食 = (int)(国家.粮食 * 0.7);
                铜钱 = (int)(国家.铜钱 * 0.7);
                全局变量.所有玩家数据表[全局变量.本机身份].基础信息.战功 -= 7000;
                break;
            case 官职信息.大将军:
                黄金 += 450000;
                粮食 += (int)(国家.粮食 * 0.75);
                铜钱 += (int)(国家.铜钱 * 0.75);
                全局变量.所有玩家数据表[全局变量.本机身份].基础信息.战功 -= 8000;
                break;
            case 官职信息.大都督:
                黄金 += 500000;
                粮食 = (int)(国家.粮食 * 0.9);
                铜钱 = (int)(国家.铜钱 * 0.9);
                全局变量.所有玩家数据表[全局变量.本机身份].基础信息.战功 -= 15000;
                break;
            case 官职信息.国王:
                黄金 += 50000;
                粮食 = (int)(国家.粮食 * 0.95);
                铜钱 = (int)(国家.铜钱 * 0.95);
                break;
            default:
                break;
        }
        国家.铜钱 -= 铜钱;
        国家.粮食 -= 粮食;
        全局变量.所有玩家数据表[全局变量.本机身份].财产信息.黄金 += 黄金;
        全局变量.所有玩家数据表[全局变量.本机身份].财产信息.铜钱 += 铜钱;
        全局变量.所有玩家数据表[全局变量.本机身份].财产信息.粮食 += 粮食;
        全局变量.提示类.显示信息($"本次领取了黄金：{黄金}\n铜钱：{铜钱}\n粮食：{粮食}");
        全局变量.领取倒计时 = 300;
        刷新官职();
    }

    private void 刷新官职()
    {
        int 战功 = (int)全局变量.所有玩家数据表[全局变量.本机身份].基础信息.战功;
        if (战功 >= 2000 && 战功 < 3000)
            全局变量.所有玩家数据表[全局变量.本机身份].基础信息.官职 = 官职信息.校尉;
        if (战功 >= 3000 && 战功 < 5000)
            全局变量.所有玩家数据表[全局变量.本机身份].基础信息.官职 = 官职信息.监军;
        if (战功 >= 5000 && 战功 < 7000)
            全局变量.所有玩家数据表[全局变量.本机身份].基础信息.官职 = 官职信息.中郎将;
        if (战功 >= 7000 && 战功 < 8000)
            全局变量.所有玩家数据表[全局变量.本机身份].基础信息.官职 = 官职信息.卫将军;
        if (战功 >= 8000 && 战功 < 15000)
            全局变量.所有玩家数据表[全局变量.本机身份].基础信息.官职 = 官职信息.大将军;
        if (战功 >= 15000)
            全局变量.所有玩家数据表[全局变量.本机身份].基础信息.官职 = 官职信息.大都督;
        if (战功 < 2000)
            全局变量.所有玩家数据表[全局变量.本机身份].基础信息.官职 = 官职信息.平民;
    }
}
